export function regexTestMessage(phrase) {
    const matches = patterns.some((pattern) =>
        new RegExp(pattern, 'i').test(phrase)
    );

    return matches;
}

const subjects = `\\s*(\\S+\\s*){0,5}?(урок|занятие|контакт(?:ы)?|(?:с[её]рф)?\\s*(?:-)?(?:школ[уы]|кэмп(?:а)?|тренер(?:а)?|инструктор(?:а)?))`;

const patterns = [
    `(ищу|ищем|подскажите|порекомендуйте|посоветуйте|дайте|нужен|нужна|нужны)${subjects}`,
    `(может(?:е)?|кто(?:-|\\s*)?(?:то)?\\s+(может|знает))\\s+(подсказать|порекомендовать|посоветовать|дать)?${subjects}`,
    `(?:с кем|у кого|где\\s+(?:можно)?|хо(чу|тим|тел|телось|тела|тели)\\s*(бы)?)\\s*((\\S+\\s+){0,8})?(взять|найти|позаниматься|потренероваться|вспомнить|научиться|пройти обучение|обучиться)`,
    `кто\\s*(\\S+\\s*){0,4}?(обучает|проводит|тренерует|дает|может)\\s+(обучить|дать|провести|потренеровать)?`,
    `(нужен|нужна|нужны|есть)${subjects}`,
    `нужно\\s*(\\S+\\s*){0,4}?(обучить|дать|провести|потренеровать)`,
];
